Courses/7140/Lectures/Languages/DSL/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DSLs for Software Engineering</title>
<!-- 2018-11-16 Fri 11:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">DSLs for Software Engineering</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Lecture using  <a href="./dsl-jlcanovas-slides-156.pptx">./dsl-jlcanovas-slides-156.pptx</a> 150+ slides
</li>
<li><a href="https://en.wikipedia.org/wiki/Domain-specific_language">https://en.wikipedia.org/wiki/Domain-specific_language</a>  Required Reading
</li>
<li><a href="https://dzone.com/articles/kotlin-dsl-from-theory-to-practice">https://dzone.com/articles/kotlin-dsl-from-theory-to-practice</a>
   Kotlin DSL  Required Reading
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Domain Specific Languages</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="http://martinfowler.com/books/dsl.html">http://martinfowler.com/books/dsl.html</a> "DSLs are small languages,
focused on a particular aspect of a software system. You can't
build a whole program with a DSL, but you often use multiple DSLs
in a system mainly written in a general purpose language."  Reference.
</li>

<li>Building a software product requires knowledge in both software
engineering and the domain the software is written for.
</li>

<li>However, common software engineering methods in fact exclude
domain experts    from the architectural design of a software
system, because the    generality of the notations defined by
these methods require expert    knowledge in the field of
software engineering and especially    software architecture. 
</li>

<li>In order to avoid this effect,    domain-specific languages
(DSL) have been proposed as an   alternative to the general
purpose languages being normally used in    software
architecture.
</li>

<li>One of the advantages of DSLs is that they are less cryptic and
easier to learn for domain experts. Of course, the design of
such a language requires deep understanding of the   problem
domain, on the other hand the existing tools for language
design are only mastered by a few experts.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> DSL Examples</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>There are easily 1000+ DSLs.  But there is no known collection of
links.  But, see
<a href="https://blog.xrds.acm.org/2013/12/on-domain-specific-language-usage/">https://blog.xrds.acm.org/2013/12/on-domain-specific-language-usage/</a> 2013
</li>

<li>Generally believed: For the development of a large software, the
cost in designing and implementing a DSL for that software
development more than offsets the development costs.
</li>

<li>The design and implementation of DSL is a highly sought after
skill.
</li>
</ol>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Well Known Examples</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>HTML  &#x2013;  web layout.  Many other "markup" lanaguages.  MarkDown,
PHP, &#x2026;
</li>
<li>sed  &#x2013;  non-interactive text editing.  <code>man sed</code> in Linux.
</li>
<li>gawk  &#x2013;  manipulate lines of text.  <code>man gawk</code> in Linux.
</li>
<li><a href="https://en.wikipedia.org/wiki/DOT_(graph_description_language)">dot</a>  &#x2013;  define graphs, with nodes and directed/ undirected edges.
</li>
<li>PlantUML  &#x2013;  A DSL to draw UML diagrams. <a href="http://plantuml.com/">http://plantuml.com/</a>
</li>
<li>SQL  &#x2013;  database query language. 
</li>
<li>build.gradle &#x2013; software build scripting
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Less Known Examples</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Gherkin  &#x2013;  A DSL to define functional tests.  <a href="https://www.guru99.com/gherkin-test-cucumber.html">https://www.guru99.com/gherkin-test-cucumber.html</a>
</li>
<li>Website-spec  &#x2013;  A DSL for functional web testing.  <a href="https://www.npmjs.com/package/website-spec">https://www.npmjs.com/package/website-spec</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Tools for the DSLs</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Several tools exist now (2018).  E.g., MPS: Domain-Specific Language
Creator by JetBrains.
</li>

<li>The tools assume good command over Grammars and ASTs.
</li>

<li>See the book by Voelter et al. (see Refs).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Javier Luis Canovas Izquierdo, Domain-specific Languages,
javier.canovas@inria.fr, <a href="./dsl-jlcanovas-slides-156.pptx">./dsl-jlcanovas-slides-156.pptx</a> 156
slides. 2013. Required Reading.
</li>

<li><a href="http://martinfowler.com/books/dsl.html">http://martinfowler.com/books/dsl.html</a> Domain Specific Languages,
Language workbenches.  2010.  <a href="http://www.informit.com/articles/article.aspx?p=1592379">DSLs: An Introductory Example</a>, first
chapter of the book.  Highly Recommended Reading.
</li>

<li>Mernik, Marjan, Jan Heering, and Anthony M. Sloane. "<a href="http://people.cis.ksu.edu/~schmidt/505f14/Lectures/WhenDSL.pdf">When and how
to develop Domain-Specific Languages</a>", ACM Computing Surveys,
vol. 37, no. 4, 2005, pp 316-344.  Recommended Reading.
</li>

<li>Markus Voelter et al., DSL Engineering: Designing, Implementing and
Using Domain-Specific Languages, 2013, <a href="http://dslbook.org/">http://dslbook.org/</a>
"Donationware".  Pretty good.  Recommended Reading.
</li>

<li>Shaikhha, Amir, Vojin Jovanovic, and Christoph Koch. "A
Compiler-Compiler for DSL Embedding." arXiv preprint
arXiv:1808.01344 (2018).    Recommended Reading.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2018-01-11
</div>
</body>
</html>
